<?php

use Illuminate\Database\Seeder;
use App\Post;
class PostSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Post::truncate();
        $chan = ['ရထားပေါ်ကမိန်းကလေး'=>'ဆရာ ချမ်းမြေ့၀င်းရဲ့ ဘာသာပြန်စာအုပ်တွေထဲကမှ ဂရုမစိုက်ခြင်းအနုပညာကိုသာ တစ်၀က်လောက် ဖတ်ဖူးပြီး သိပ်မကြိုက်တော့ လို့ ဆက်မဖတ်ဖြစ်ပေမဲ့ ဒီ ရထားပေါ်ကမိန်းကလေး စာအုပ်ကိုတော့ နာမည်ကြီးနေတာကတစ်ကြောင်း၊ရီဗြူးတွေထဲမှာ လျှို့ဝှက်သည်းဖို ဖြစ်တဲ့စာအုပ်တစ်အုပ်ဖြစ်ကြောင်း၊စာအုပ်ကျောအဖုံးမှာပါတဲ့ စာအပိုင်းလေးကို ဖတ်ကြည့်ပြီးစိတ်၀င်စားသွားတာရယ် တစ်ကြောင်း တွေကြောင့် ဒီစာအုပ်လေး၀ယ်ဖတ်ဖြစ်သွားတယ်ဆိုပါတော့။
        ‌ရသ၀တ္ထုမျိုး၊အတ္ထုပ္ပတ္တိ၀တ္ထုမျိုး၊သမိုင်းနောက်ခံ၀တ္ထုမျိုး တွေ ဖတ်ဖူးပေမဲ့ ဒီစာအုပ်ကတော့ ကျွန်တော် မဖတ်ဖူးတဲ့စာအုပ်အမျိုးအစားတစ်ခုဖြစ်ပေတယ်။(ရသလို့ဆိုနိုင်‌ပေမဲ့ နည်းနည်းကွဲထွက်တယ်လို့ခံစားမိခြင်းပါ) ဒီစာအုပ်ကိုတော့ ဘာသာပြန်သူက “unreliable narrators (စိတ်မချရသောဇာတ်ကြောင်းပြောသူများ) ဆိုတဲ့ စာအုပ်အမျိုးအစားဟာ အနောက်တိုင်းမှာတော့နာမည်ကြီးနေခဲ့တာကြာပါပြီ။ဇာတ်လမ်းကိုပြောပြနေတဲ့သူက အကြောင်းအမျိုးမျိုးကြောင့် အမှန်အတိုင်းမပြောတာ၊မမှတ်မိတာ ဇဝေဇဝါဖြစ်နေတာ..ဖတ်ရင်းဖတ်ရင်းနဲ့မှ အဖြစ်မှန်ကို တဖြည်းဖြည်းသိလာတာစတဲ့ ဇာတ်အိမ်တည်ဆောက်ပုံတွေနဲ့ ပရိတ်သတ်ကိုဖမ်းစားတဲ့စာအုပ်တွေပေါ့ ”လို့ဆိုပြီး အမှာစာထဲမှာ ပြောထားပါတယ်။
        စာအုပ်ထဲမှာတော့ အမျိုးသမီး‌တွေ ဖြစ်တဲ့ ရေချယ်၊မီဂန်၊အန်နာ သူတို့၃ဦးကိုအဓိကထားပြီး တစ်ယောက်ခြင်းစီရဲ့ ရှု့ထောင့်ကနေ ခံစားပြီး ရေးသားထားပါတယ်။ ရေချယ်နေရာကနေရေးတဲ့အခန်းဆို ကိုယ်ဟာ ရေချယ်နေရာ၊မီဂန်အခန်းဆို ကိုယ်ဟာ မီဂန်၊အန်နာဆိုကိုယ်ဟာအန်နာ၊ ဖြစ်သွားအောင် ဆွဲဆောင်ထားတယ်။
        အမျိုးသမီးတစ်ယောက်ခြင်းရဲ့ရှု့ထောင်ကနေတင်ပြထားတဲ့အခါမှာလည်း လက်ရှိပစ္စုပ္ပါန်၊အတိတ်စတာ‌တွေရဲ့ အချိန်(နေ့/ည)၊နေရာ၊ရက်စွဲ တွေကို ပါတိတိကျကျဖော်ပြထားပေးပြီး အတိတ်နဲ့လက်ရှိကိုတလှည့်စီ ဖော်ပြထားပေးခြင်းကလဲ ဒီစာအုပ်ရဲ့ အသက်လို့တောင်ဆိုရမယ်။
        ရေချယ်ဆိုတဲ့သူကတော့ အရက်စွဲ၊ အိမ်ထောင်နဲ့ကွဲ၊အလုပ်လက်မဲ့၊ပြီး‌တော့ လန်ဒန်မြို့ထဲကို ရထားနဲ့အသွားအပြန်လုပ်နေတဲ့မိန်းကလေးတစ်ယောက်။ရထားလမ်းဘေးမှာတော့ သူယခင်ကသူ့‌ယောကျာ်းနဲ့ နေခဲ့တဲ့အိမ်နံပါတ်၂၃၊ ပြီးတော့ အိမ်နံပါတ်၁၅။အဲ့အိမ်နံပါတ်၁၅မှာ‌တော့သူ‌ယောကျာ်းနဲ့ကွဲပြီးကာမှအသစ်ပြောင်းလာတဲ့စုံတွဲတစ်တွဲ။အဲ့စုံတွဲကို အသွားအပြန်ရထားပေါ်ကနေအမြဲငေးမောပြီး ရင်းနှီးနေခဲ့၊အားကျနေခဲ့၊ရူးသွပ်နေခဲ့တယ်ဆိုလဲ မမှားဘူး။တစ်နေ့မှာ တော့ ထိုအိမ်ကစုံတွဲမှ အမျိုးသမီးက တခြားအမျိုးသားတစ်ဦးနဲ့ နမ်းနေတာကို လျှပ်တစ်ပြတ်မြင်လိုက်ရချိန်မှာတော့ ..... 
        ဇာတ်‌ကောင် အမျိုးသမီးတစ်ဦး ပျောက်ဆုံးရခြင်းအပေါ် အဘယ်ကြောင့်‌ပျောက်‌‌နေသည်ဆိုတာကို သိချင်ဇောအပြင် လျှို့ဝှက်မှု၊ဇဝေဇဝါဖြစ်မှု၊ အော့နှလုံးနာမှု၊ မွန်းကျပ်မှုတွေနဲ့ စာအုပ်ကိုနောက်ဆုံးအချိန်ထိ ဆွဲခေါ်သွားပါတယ်။ဒါ့အပြင် 
        အမျိူးသမီးတစ်ဦးခြင်းရဲ့ စိတ်ခံစားမှု၊ စွဲလမ်းမှု၊တပ်မက်မှု၊‌ဖောက်ပြန်မှု၊စိတ်ဓါတ်ကျမှု၊လိမ်ညာမှု၊ရုန်းကန်မှု၊ လိင်စိတ်၊သံသယစိတ်၊နာကြဉ်းစိတ်၊အချစ်စိတ်စတာတွေကို မကွယ်မဝှက် ပြင်းပြင်းထန်ထန်ဖော်ပြထားပါတယ်။ 
        ဒီစာအုပ်က သင့်ကို ဖျော်ဖြေမှုပေးနိုင်မယ်လို့ ယုံကြည်ပါတယ်။ဒါပေမဲ့အသက်အရမ်းငယ်တဲ့ ကလေးတွေတော့ ဖတ်ရန်မသင့်သေးဘူးလို့ထင်မိတယ်။',
        'ဂရုမစိုက်ခြင်းအနုပညာ' => 'ဒီစာအုပ်ဟာ အောင်မြင်ရေးစာအုပ်မဟုတ်သလို သူဌေးဖြစ်နည်းစာအုပ်လည်း မဟုတ်ဘူး။ အမြန်ဆုံး စိတ်ချမ်းသာနည်းတွေစုထားတဲ့ ဆုံးမစကားပေါင်းချုပ်လည်း မဟုတ်ဘူး။ တက်ကျမ်းလည်းမဟုတ်ဘူး။ လူ့ဘဝရဲ့ ရှောင်မရတဲ့ ပြဿနာပေ့ါင်း သောင်းခြောက်ထောင်ကို ရင်ဆိုင်နိုင်ဖို့၊ ရှုပ်ထွေးတဲ့ပတ်ဝန်းကျင်ကို နည်းနည်းလေးပိုရှင်းသွားအောင် မြင်တတ်ဖို့၊ အရာရာတိုင်းကို ဂရုစိုက်နေရတဲ့ ဒီနေ့လူသားတွေအတွက် ဂရုမစိုက်ခြင်းအနုပညာဆိုတာ ရိုးရိုးလေးပဲပြောပြတဲ့ စာအုပ်ပါပဲ…….',

    ];
        $thint = [
           'အိုဘယ့်အစိမ်းတို့မြေ' =>'မြန်မာနိုင်ငံဖွား ကယန်းတိုင်းရင်းသားတစ်ယောက်၏ကမ္ဘာကျော် စာအုပ်၊
            ၂၀၀၂ခုနှစ် တောင်အာရှအကောင်းဆုံး 
            စာပေဆုရ စာအုပ်၊
            စာပေဆုများတွင် ဂုဏ်သိက္ခာကြီးမားသည့် 
            Kiriyama Pacific Rim ဆု ရရှိခဲ့သည့် စာအုပ်၊
            ပါစကယ်ခူးသွယ်လို့ခေါ်တဲ့ ပဒေါင်လူမျိုးတိုင်းရင်းသားလေး၊ ဇာတိက ရှမ်းပြည်နယ်ထဲက ဖယ်ခုံဆိုတဲ့ မြို့ငယ်လေး။ မိဘနွယ်ဖွားတွေက ကယန်း(ပဒေါင်)မျိုးနွယ်စု၊ လည်ပင်းမှာ ကြေးကွင်းတွေအထပ်လိုက် ဝတ်ဆင်ကြလို့ ကမ္ဘာပေါ်မှာ ထင်ရှားတဲ့ မျိုးနွယ်စု။
            ဒီစာအုပ်ထဲမှာ ပဒေါင်လူမျိုးတွေအကြောင်း၊ သူတို့ရဲ့လူနေမှု၊ 
            ထုံးတမ်းအစဉ်အလာ ၊ ရိုးရာယဉ်ကျေးမှုတွေ ပါတယ်၊ လည်ပင်းရှည်ကြီးတွေမှာ ကြေးကွင်းတွေအထပ်လိုက် ဝတ်ဆင်ကြပုံတွေပါတယ်၊ သူတို့ကိုးကွယ်တဲ့ ခရစ်ယာန် ကတ်သလစ်အကြောင်းတွေပါတယ်၊ မြန်မာ့နိုင်ငံရေးပါတယ်၊ မန္တလေးမြို့အကြောင်းပါတယ်၊ ၈၈အရေးတော်ပုံအကြောင်း၊ ပါတီဥက္ကဋ္ဌကြီး နေဝင်း ၊အမဲသားသည်ကြီး စိန်လွင်၊ တစ်ပါတီအာဏာရှင်စနစ်
            ရက်စက်ယုတ်မာခဲ့ပုံ၊ ကျောင်းသားများအပေါ် ရက်ရက်စက်စက် ပစ်ခတ်ခဲ့ကြပုံ၊ မြန်မာ့ဆိုရှယ်လစ်လမ်းစဉ်ပါတီ၊ နဝတ၊ မဝတရဲ့ အရူးဇာတ်တွေအကြောင်း ပါတယ်၊ 
            မန္တလေးမှာ ကျောင်းတက်နေစဉ် ထမင်းဆိုင်မှာ ဘဝပေးအခြေအနေအရ စားပွဲထိုးဝင်လုပ်နေတုန်း အင်္ဂလန်နိုင်ငံသား ကိန်းဘရစ်ခ်ျတက္ကသိုလ်ပါမောက္ခ ဂျွန်ကေစီနှင့် တွေ့ဆုံခဲ့၊ ရှစ်လေးလုံးအရေးအခင်းကြီးမှာ ပါဝင်ခဲ့ပြီး အစိုးရနှင့် ထိပ်တိုက်တွေ့၊ ဒေသအာဏာပိုင်များနှင့် ပဋိပက္ခဖြစ်ပွားခဲ့ပြီး ထိုင်းနယ်စပ်သို့ ထွက်ပြေးခဲ့ရ၊ ကရင်နီလွတ်မြောက်ရေးတပ်မတော်ထံ ခိုလှုံခဲ့၊ ဂျွန်ကေစီနှင့် ဆက်သွယ်မိပြီး ဘန်ကောက်မှတဆင့် အင်္ဂလန်နိုင်ငံသို့ ရောက်ရှိ၍ ပညာဆက်လက်သင်ကြားခွင့်ရ၊ ကမ္ဘာ့နံပါတ်တစ် ထိပ်တန်းတက္ကသိုလ်ကြီးဖြစ်တဲ့ ကိန်းဘရစ်ခ်ျတက္ကသိုလ်မှ ဘွဲ့ရရှိခဲ့ ။
            မြန်မာနိုင်ငံဖွားတိုင်းရင်းသားတစ်ဦးရဲ့ အံ့အားသင့်စရာ စိတ်လှုပ်ရှားစရာ၊ လေးစားအတုယူစရာ ဖြစ်ရပ်မှန်ဇာတ်လမ်းတစ်ပုဒ်၊ မြန်မာနိုင်ငံ၊ မြန်မာနိုင်ငံသားတို့ ဂုဏ်ယူရမည့် ဖတ်ရှု
            မှတ်သားသင့်သော စာအုပ်ကောင်းတစ်အုပ်။',
           'သားသတ်လွတ်သမ' =>'ယောင်ဟေး လို့ခေါ်တဲ့ အိမ်ထောင်ရှင်အမျိုးသမီးက အိပ်မက်တစ်ခုကြောင့် အသားဆက်မစားတော့ဘူး ။ တဖြည်းဖြည်းနဲ့ ပိန်လှီလာတယ် ။
            နောက်တစ်ယောက်က ယောင်ဟေးအမရဲ့ ယောက်ကျား ။ အနုပညာကျောင်းဆင်းပြီး ဝင်ငွေမယ်မယ်ရရမရှိပေမယ့် ထူးခြားဆန်းသစ်တဲ့အတွေးတွေ ရှိနေတတ်တဲ့သူ ။
            အင်ဟေး ။ သူကကျ တချိန်မှာဖြစ်ပျက်လာမယ့် ယောင်ဟေးရဲ့ စိတ္တဇဆန်ဆန်ဘဝကို ကြည့်ရှုစောင့်ရှောက်ရမယ့် အမအရင်း ။ အိမ်ထောင်ဖက်ရဲ့ ဂရုစိုက်ခြင်းလဲ မရခဲ့တဲ့သူ ။
            ဒီလူသုံးယောက်ရဲ့  ရှုထောင့်သုံးခုကအတွေးတွေကို ရေးပြထားတာသိပ်လှတယ် ။ စိန်ပြေနပြေဖတ်လိုက်၊ ပြန်ပြီးတွေးလိုက်နဲ့ Psycho ဆန်ဆန်ရသ,က ဖတ်ဖူးနေကျစာအုပ်တွေကြားထဲ သွေဖယ်နေတယ် ။
            ဒီစာအုပ်လေးက The Man Booker International Prize (2016) ရရှိထားတဲ့ Han Kang ရဲ့ The Vegetarian ကို ဘာသာပြန်ဆိုထားတဲ့စာအုပ်ပါ ။ အားလပ်ချိန်ကျ ခံစားမှုအသစ်လေးတွေရအောင် မြည်းစမ်းကြည့်ပေါ့ဗျာ ။',
            
        ];
        foreach($chan as $title => $content)
        {
            $posts = new Post;
            $posts->user_id = 4;
            $posts->author_id = 1;
            $posts->category_id = 1;
            $posts->title = $title;
            $posts->content = $content;
            $posts->save();
        }
        foreach($thint as $title => $content)
        {
            $posts = new Post;
            $posts->user_id = 4;
            $posts->author_id = 2;
            $posts->category_id = 1;
            $posts->title = $title;
            $posts->content = $content;
            $posts->save();
        }

            


        // Post::truncate();

        

        // $haha = ['haha' => 'baba'];
        // foreach($haha as $title => $content){
        //     $post = new Post();
        //     $post->userid_id = rand(1,10);
        //     $post->author_id = 1;
        //     $post->category_id = 1;
        //     $post->title = $title;
        //     $post->content = $content;
        //     $post->save();
        // }

    }
}
